import { bpd, bpds, Braille } from "braillepatterndots-js";

const special = {
  온표: bpd(123456), //111 111
  붙임표: bpd(36), //001 001
  된소리표: bpd(6), //000 001
  옛글자표: bpd(5), //000 010
  빈표: bpd(0), //000 000
};

const onset: { [hangul: string]: Braille[] } = {
  //abbreviation
  가: bpds(1246), //110 101
  사: bpds(123), //111 000
  것: bpds(456, 234), //000 111, 011 100
  //consonant
  ㄱ: bpds(4), //000 100
  ㄴ: bpds(14), //100 100
  ㄷ: bpds(24), //010 100
  ㄹ: bpds(5), //000 010
  ㅁ: bpds(15), //100 010
  ㅂ: bpds(45), //000 110
  ㅅ: bpds(6), //000 001
  ㅇ: bpds(1245), //110 110
  ㅈ: bpds(46), //000 101
  ㅊ: bpds(56), //000 011
  ㅋ: bpds(124), //110 100
  ㅌ: bpds(125), //110 010
  ㅍ: bpds(145), //100 110
  ㅎ: bpds(245), //010 110
  ㄲ: bpds(4), //000 100
  ㄸ: bpds(24), //010 100
  ㅃ: bpds(45), //000 110
  ㅆ: bpds(6), //000 001
  ㅉ: bpds(46), //000 101
  //반치음 - ᅀ
  반치음: bpds(5, 46), //000 010, 000 101
  //옛이응 - ᅌ
  옛이응: bpds(5, 145), //000 010, 100 110
  // 여린히읗 - ᅙ
  여린히읗: bpds(5, 245), //000 010, 010 110
};

const nucleus: { [hangul: string]: Braille[] } = {
  // abbreviation
  억: bpds(1456), //100 111
  언: bpds(23456), //011 111
  얼: bpds(2345), //011 110
  연: bpds(16), //100 001
  열: bpds(1256), //110 011
  영: bpds(12456), //110 111
  옥: bpds(1346), //101 101
  온: bpds(12356), //111 011
  옹: bpds(123456), //111 111
  운: bpds(1245), //110 110
  울: bpds(12346), //111 101
  은: bpds(1356), //101 011
  을: bpds(2346), //011 101
  인: bpds(12345), //111 110
  // vowel
  ㅏ: bpds(126), //110 001
  ㅑ: bpds(345), //001 110
  ㅓ: bpds(234), //011 100
  ㅕ: bpds(156), //100 011
  ㅗ: bpds(136), //101 001
  ㅛ: bpds(346), //001 101
  ㅜ: bpds(134), //101 100
  ㅠ: bpds(146), //100 101
  ㅡ: bpds(246), //010 101
  ㅣ: bpds(135), //101 010
  ㅐ: bpds(1235), //111 010
  ㅒ: bpds(345, 1235), //001 110, 111 010
  ㅔ: bpds(1345), //101 110
  ㅖ: bpds(34), //001 100
  ㅘ: bpds(1236), //111 001
  ㅙ: bpds(1236, 1235), //111 001, 111 010
  ㅚ: bpds(13456), //101 111
  ㅝ: bpds(1234), //111 100
  ㅞ: bpds(1234, 1235), //111 100, 111 010
  ㅟ: bpds(134, 1235), //101 100, 111 010
  ㅢ: bpds(2456), //010 111
};

const coda: { [hangul: string]: Braille[] } = {
  ㄱ: bpds(1), //100 000
  ㄴ: bpds(25), //010 010
  ㄷ: bpds(35), //001 010
  ㄹ: bpds(2), //010 000
  ㅁ: bpds(26), //010 001
  ㅂ: bpds(12), //110 000
  ㅅ: bpds(3), //001 000
  ㅇ: bpds(2356), //011 011
  ㅈ: bpds(13), //101 000
  ㅊ: bpds(23), //011 000
  ㅋ: bpds(235), //011 010
  ㅌ: bpds(236), //011 001
  ㅍ: bpds(256), //010 011
  ㅎ: bpds(356), //001 011
  ㄲ: bpds(1, 1), //100 000, 100 000
  ㅆ: bpds(34), //001 100
  //반치음 - ᅀ
  반치음: bpds(5, 13), //000 010, 101 000
  //옛이응 - ᅌ
  옛이응: bpds(5, 256), //000 010, 010 011
  // 여린히읗 - ᅙ
  여린히읗: bpds(5, 356), //000 010, 001 011
};

const kobrailleTable = {
  special: special,
  onset: onset,
  nucleus: nucleus,
  coda: coda,
};

export default kobrailleTable;
